
## Plan Result

[CI link](https://github.com/shotaIDE/my-pet-melody/actions/runs/10839946846)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 4 to change, 1 to destroy.</code></pre>

* Update
  * google_cloudfunctions_function.detect
  * google_cloudfunctions_function.piece
  * google_cloudfunctions_function.submit
  * google_project.default
* Replace
  * google_storage_bucket_object.functions_src


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_ee2cf6b3905324101c816c672baf37ab.zip" -> "functions/src_d297db43f0b6f5ff2ce57bd9fb294975.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_ee2cf6b3905324101c816c672baf37ab.zip" -> "functions/src_d297db43f0b6f5ff2ce57bd9fb294975.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_ee2cf6b3905324101c816c672baf37ab.zip" -> "functions/src_d297db43f0b6f5ff2ce57bd9fb294975.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_project.default will be updated in-place
  ~ resource "google_project" "default" {
      ~ deletion_policy     = "DELETE" -> "PREVENT"
        id                  = "projects/colomney-my-pet-melody-dev"
        name                = "MyPetMelody-Dev"
        # (7 unchanged attributes hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "2OXqjQ==" -> (known after apply)
      ~ detect_md5hash      = "7iz2s5BTJBAcgWxnK683qw==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_ee2cf6b3905324101c816c672baf37ab.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "7iz2s5BTJBAcgWxnK683qw==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_ee2cf6b3905324101c816c672baf37ab.zip?generation=1725578312502024&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_ee2cf6b3905324101c816c672baf37ab.zip" -> "functions/src_d297db43f0b6f5ff2ce57bd9fb294975.zip" # forces replacement
      ~ output_name         = "functions/src_ee2cf6b3905324101c816c672baf37ab.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_ee2cf6b3905324101c816c672baf37ab.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"check-plan","PRNumber":1325,"Program":"tfcmt","SHA1":"4660fdb2da9c1c05d0904082375899aa040101ae","Vars":{},"WorkflowName":"CI / Infrastructure Develop"} -->